#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МаксимальноеЧислоЗаписей = 10000;
	УниверсальныеШаблоныПоиска();
	ПорцииДляУдаления = 15000;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Анализ(Команда)
	
	АнализНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСУчетомШаблонов(Команда)
	
	УдалитьСистемныеНастройкиПользователя(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеНастройки(Команда)
	
	УдалитьСистемныеНастройкиПользователя(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИсториюРаботыПользователей(Команда)
	ИсторияРаботыПользователя.ОчиститьВсе();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ИНИЦИАЛИЗАЦИЯ

&НаСервере
Процедура УниверсальныеШаблоныПоиска()

	НовСтрока = НастройкиДляАнализа.Добавить();
	НовСтрока.Использовать = Ложь;
	НовСтрока.ШаблонПоиска = "ОбщаяФорма.Вопрос";
	НовСтрока.ЭтоИмяФормы = Истина;
	
	НовСтрока = НастройкиДляАнализа.Добавить();
	НовСтрока.Использовать = Ложь;
	НовСтрока.ШаблонПоиска = "ОбщаяФорма.ВводКомментария";
	НовСтрока.ЭтоИмяФормы = Истина;
	
	НовСтрока = НастройкиДляАнализа.Добавить();
	НовСтрока.Использовать = Ложь;
	НовСтрока.ШаблонПоиска = "НастройкиОкна";
	НовСтрока.ЭтоИмяФормы = Ложь;
	
	НовСтрока = НастройкиДляАнализа.Добавить();
	НовСтрока.Использовать = Ложь;
	НовСтрока.ШаблонПоиска = "ИсторияПоискаТаблицы";
	НовСтрока.ЭтоИмяФормы = Ложь;
	
	НовСтрока = НастройкиДляАнализа.Добавить();
	НовСтрока.Использовать = Ложь;
	НовСтрока.ШаблонПоиска = "КлючНаборовСвойств";
	НовСтрока.ЭтоИмяФормы = Ложь;

КонецПроцедуры

// АНАЛИЗ

&НаСервере
Процедура АнализНаСервере()
	
	СистемныеНастройки = ПолучитьСистемныеНастройкиИзИБ(МаксимальноеЧислоЗаписей);
	ВывестиСистемныеНастройкиПользователю(СистемныеНастройки);
	ПроанализироватьШаблоныСистемныхНастроек(СистемныеНастройки);
	ОбновитьСтранцуРезультатыАнализа(СистемныеНастройки);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСистемныеНастройкиИзИБ(МаксимальноеЧислоЗаписей)
	
	ОтборыСистемныхНастроек = ПодготовитьОтборыДляСистемныхНастроек();
	СистемныеНастройки = ТаблицаВыводаСистемныхНастроек();
	ВсегоЗаписей = 0;
	
	СистемныеНастройкиИзИБ = ХранилищеСистемныхНастроек.Выбрать(ОтборыСистемныхНастроек);
	Пока СистемныеНастройкиИзИБ.Следующий() Цикл
		СтрокаНастройки = СистемныеНастройки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНастройки, СистемныеНастройкиИзИБ);
		Если ВсегоЗаписей >= МаксимальноеЧислоЗаписей Тогда
			Прервать; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат СистемныеНастройки;
	
КонецФункции

&НаСервере
Процедура ВывестиСистемныеНастройкиПользователю(СистемныеНастройки)
	
	ПострПечать = Новый ПостроительОтчета;
	ПострПечать.ИсточникДанных = Новый ОписаниеИсточникаДанных(СистемныеНастройки);
	ПострПечать.Выполнить();
	Для каждого Колонка Из ПострПечать.ВыбранныеПоля Цикл
		Колонка.Представление = СистемныеНастройки.Колонки[Колонка.Имя].Заголовок;
	КонецЦикла;
	ПострПечать.Вывести(ТабДок);
	
КонецПроцедуры

&НаСервере
Процедура ПроанализироватьШаблоныСистемныхНастроек(СистемныеНастройки)
	
	СброситьНайденоПоШаблону();
	
	ШаблоныДляАнализа = ПолучитьШаблоныОчисткиПоТаблице(Истина);
	Если ШаблоныДляАнализа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СистемнаяНастройка ИЗ СистемныеНастройки Цикл
		
		Для каждого ДанныеШаблонаПоиска ИЗ ШаблоныДляАнализа Цикл
			
			СтрокаПодходит = СтрокаПодходитПодШаблонПоиска(СистемнаяНастройка, ДанныеШаблонаПоиска);
			Если СтрокаПодходит Тогда
				ДанныеШаблонаПоиска.НайденоПоШаблону = ДанныеШаблонаПоиска.НайденоПоШаблону + 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для каждого НастройкаДляАнализа ИЗ НастройкиДляАнализа Цикл
		
		Для каждого ДанныеШаблонаПоиска ИЗ ШаблоныДляАнализа Цикл
			
			Если НастройкаДляАнализа.ШаблонПоиска = ДанныеШаблонаПоиска.ШаблонПоиска Тогда
				НастройкаДляАнализа.НайденоПоШаблону = НастройкаДляАнализа.НайденоПоШаблону + ДанныеШаблонаПоиска.НайденоПоШаблону;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СтрокаПодходитПодШаблонПоиска(СистемнаяНастройка, ДанныеШаблонаПоиска)
	
	СтрокаПоиска = СистемнаяНастройка.КлючОбъекта;
	ШаблонПоиска = ДанныеШаблонаПоиска.ПодстрокаШаблона;
	
	ШаблонПодходит = СтрНайти(СтрокаПоиска, ДанныеШаблонаПоиска.ШаблонПоиска);
	ДлинаПодходит = Истина;
	Если ДанныеШаблонаПоиска.ДлинаКлюча <> 0 Тогда
		ДлинаПодходит = СтрДлина(СистемнаяНастройка.КлючОбъекта) = ДанныеШаблонаПоиска.ДлинаКлюча;
	КонецЕсли;
	
	СтрокаПодходит = Ложь;
	Если ШаблонПодходит И ДлинаПодходит Тогда
		СтрокаПодходит = Истина;
	КонецЕсли;
	Возврат СтрокаПодходит;
	
КонецФункции

&НаСервере
Функция ПодготовитьОтборыДляСистемныхНастроек()
	
	ОтборыСистемныхНастроек = Новый Структура;
	Если ЗначениеЗаполнено(ВыбрПользователь) Тогда
		ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбрПользователь, "ИдентификаторПользователяИБ");
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
		ИмяПользователя = ПользовательИБ.Имя;
		ОтборыСистемныхНастроек.Вставить("Пользователь", ПользовательИБ.Имя);
	КонецЕсли;
	Возврат ОтборыСистемныхНастроек;
	
КонецФункции

&НаСервере
Функция ТаблицаВыводаСистемныхНастроек()
	
	ТаблицаВыводаСистемныхНастроек = Новый ТаблицаЗначений;
	ТаблицаВыводаСистемныхНастроек.Колонки.Добавить("Пользователь", , "Пользователь");
	ТаблицаВыводаСистемныхНастроек.Колонки.Добавить("КлючОбъекта", , "Ключ объекта", 30);
	ТаблицаВыводаСистемныхНастроек.Колонки.Добавить("КлючНастроек", , "Ключ настроек");
	ТаблицаВыводаСистемныхНастроек.Колонки.Добавить("Представление", , "Представление");
	Возврат ТаблицаВыводаСистемныхНастроек;
	
КонецФункции

&НаСервере
Процедура СброситьНайденоПоШаблону()
	
	Для каждого ЭлементКоллекции ИЗ НастройкиДляАнализа Цикл
		
		ЭлементКоллекции.НайденоПоШаблону = 0;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтранцуРезультатыАнализа(СистемныеНастройки)
	
	Элементы.СтраницаРезультатыАнализа.Заголовок = "Результаты анализа (" + СистемныеНастройки.Количество() + ")";
	
КонецПроцедуры


// ОЧИСТКА

&НаСервере
Процедура УдалитьСистемныеНастройкиПользователя(ПрименятьШаблон)
	
	Если ПрименятьШаблон Тогда
		МассивШаблонов = ПолучитьШаблоныОчисткиПоТаблице();
	КонецЕсли;
	
	Счетчик = 0;
	
	ОтборыСистемныхНастроек = ПодготовитьОтборыДляСистемныхНастроек();
	СистемныеНастройки = ТаблицаВыводаСистемныхНастроек();

	СистемнаяНастройка = ХранилищеСистемныхНастроек.Выбрать(ОтборыСистемныхНастроек);
	Пока СистемнаяНастройка.Следующий() Цикл
		
		Если ПрименятьШаблон Тогда
			
			СтрокаПодходит = Ложь;
			Для Каждого ДанныеШаблонаПоиска Из МассивШаблонов Цикл
				
				ЭлемШаблонаПодходит = СтрокаПодходитПодШаблонПоиска(СистемнаяНастройка, ДанныеШаблонаПоиска);
				Если ЭлемШаблонаПодходит Тогда
					СтрокаПодходит = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			СтрокаПодходит = Истина;
			
		КонецЕсли;
		
		Если СтрокаПодходит Тогда
			
			НоваяСтрока = СистемныеНастройки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СистемнаяНастройка);
			
			Счетчик = Счетчик + 1;
			Если Счетчик >= ПорцииДляУдаления Тогда 
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого стр Из СистемныеНастройки Цикл
		ХранилищеСистемныхНастроек.Удалить(стр.КлючОбъекта, стр.КлючНастроек, стр.Пользователь);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьШаблоныОчисткиПоТаблице(ИгнорироватьФлагИспользовать = Ложь)
	
	// Ключи настроек форм имеют примерно такой вид:
	// "ОбщаяФорма.ВводКомментария/0131c7c6_c847_4b9f_aff5_e466aaf2111d/НастройкиОкна"
	// "ОбщаяФорма.Вопрос/0131c7c6_c847_4b9f_aff5_e466aaf2626d/НастройкиОкна"
	// "ОбщаяФорма.Вопрос/0131c7c6_c847_4b9f_aff5_e466aaf2626d/Такси/НастройкиОкна"
	// Для каждой формы могут быть отдельные настройки для Такси и для старого управляемого интерфейса.
	
	МассивШаблонов = Новый Массив();
	
	ШаблонКлючаУпрПриложение = "/0131c7c6_c847_4b9f_aff5_e466aaf2626d/НастройкиОкна";
	ШаблонКлючаТакси = "/0131c7c6_c847_4b9f_aff5_e466aaf2626d/Такси/НастройкиОкна";
	
	ДлинаКлючаУпрПриложение = СтрДлина(ШаблонКлючаУпрПриложение);
	ДлинаКлючаТакси =  СтрДлина(ШаблонКлючаТакси);

	Для Каждого Стр Из НастройкиДляАнализа Цикл
		
		Если НЕ ИгнорироватьФлагИспользовать И НЕ Стр.Использовать Тогда
			Продолжить;
		КонецЕсли;
		
		ШаблонПоиска = Стр.ШаблонПоиска;
		ДлинаШаблона = 0;
		
		Если Стр.ЭтоИмяФормы Тогда
			
			ШаблонПоиска= ШаблонПоиска + "/";
			
			ДлинаШаблона = СтрДлина(Стр.ШаблонПоиска);
			
			ДлинаШаблонаУпрПриложение = ДлинаШаблона + ДлинаКлючаУпрПриложение;
			ДлинаШаблонаТакси = ДлинаШаблона + ДлинаКлючаТакси;
			
			НовШаблон = Новый Структура("ШаблонПоиска, ПодстрокаШаблона, ДлинаКлюча, НайденоПоШаблону", 
				Стр.ШаблонПоиска, 
				ШаблонПоиска, 
				ДлинаШаблонаУпрПриложение,
				0);
			МассивШаблонов.Добавить(НовШаблон);
			
			НовШаблон = Новый Структура("ШаблонПоиска, ПодстрокаШаблона, ДлинаКлюча, НайденоПоШаблону", 
				Стр.ШаблонПоиска, 
				ШаблонПоиска, 
				ДлинаШаблонаТакси,
				0);
			МассивШаблонов.Добавить(НовШаблон);
			
		Иначе
			
			НовШаблон = Новый Структура("ШаблонПоиска, ПодстрокаШаблона, ДлинаКлюча, НайденоПоШаблону", 
				Стр.ШаблонПоиска, 
				ШаблонПоиска, 
				ДлинаШаблона,
				0);
			МассивШаблонов.Добавить(НовШаблон);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивШаблонов;
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ОчиститьВсеНастройкиНеСуществующихПользователей(Команда)
	ОчиститьВсеНастройкиНеСуществующихПользователейНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьВсеНастройкиНеСуществующихПользователейНаСервере()
	
	ТаблицаРезультатов = Новый ТаблицаЗначений;
	ТаблицаРезультатов.Колонки.Добавить("Пользователь", , "Пользователь");
	ТаблицаРезультатов.Колонки.Добавить("КлючОбъекта", , "Ключ объекта");
	ТаблицаРезультатов.Колонки.Добавить("КлючНастроек", , "Ключ настроек");
	ТаблицаРезультатов.Колонки.Добавить("Представление", , "Представление");
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	ИменаПользователей = Новый Массив;
	Для Каждого ПользовательИБ из ПользователиИБ Цикл
		ИменаПользователей.Добавить(ПользовательИБ.Имя);
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Выб = ХранилищеСистемныхНастроек.Выбрать();
	Счетчик = 0;
	
	Пока Выб.Следующий() Цикл
		Если Выб.Пользователь <> "" 
			И ИменаПользователей.Найти(Выб.Пользователь) = Неопределено Тогда
			
			НоваяСтрока = ТаблицаРезультатов.Добавить();
			НоваяСтрока.Пользователь = Выб.Пользователь;
			НоваяСтрока.КлючОбъекта = Выб.КлючОбъекта;
			НоваяСтрока.КлючНастроек = Выб.КлючНастроек;
			НоваяСтрока.Представление = Выб.Представление;
			
			Счетчик = Счетчик + 1;
		КонецЕсли;
		
		Если Счетчик = ПорцииДляУдаления Тогда 
			Прервать;
		КонецЕсли;	
	КонецЦикла;
		
	Для каждого стр Из ТаблицаРезультатов Цикл
		ХранилищеСистемныхНастроек.Удалить(стр.КлючОбъекта, стр.КлючНастроек, стр.Пользователь);	
	КонецЦикла;
	 
	Сообщить("Удалено настроек: " + Счетчик);

КонецПроцедуры


