 Функция СведенияОВнешнейОбработке() Экспорт 
	 
	 ПараметрыРегистрации = Новый Структура; 
	 ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка"); 
	 
	 МассивНазначений = Новый Массив; 
	 ПараметрыРегистрации.Вставить("Назначение", МассивНазначений); 
	 
	 ПараметрыРегистрации.Вставить("Наименование", "Создание корректировки регистров ""Товары на складах"" и ""Свободные остатки"" по Excel-шаблону"); 
	 ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина); 
	 ПараметрыРегистрации.Вставить("Версия", "1.0"); 
	 ПараметрыРегистрации.Вставить("Информация", "Обработка 'Создание корректировки регистров ""Товары на складах"" и ""Свободные остатки"" по Excel-шаблону'"); 
	 
	 ТаблицаКоманд = ПолучитьТаблицуКоманд(); 
	 
	 ДобавитьКоманду(ТаблицаКоманд, 
		 "Создание корректировки регистров ""Товары на складах"" и ""Свободные остатки"" по Excel-шаблону", 
		 "СозданиеКорректировкиРегистровПоExcelШаблону", 
		 "ОткрытиеФормы",
		 Ложь,
		 "");

	 ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд); 
	 
	 Возврат ПараметрыРегистрации; 
	 
 КонецФункции 
 
 Функция ПолучитьТаблицуКоманд() 
	 
	 Команды = Новый ТаблицаЗначений; 
	 Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка")); 
	 Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка")); 
	 Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка")); 
	 Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево")); 
	 Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка")); 
	 
	 Возврат Команды; 
	 
 КонецФункции 
 
 Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "") 
	 
	 НоваяКоманда = ТаблицаКоманд.Добавить(); 
	 НоваяКоманда.Представление = Представление; 
	 НоваяКоманда.Идентификатор = Идентификатор; 
	 НоваяКоманда.Использование = Использование; 
	 НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение; 
	 НоваяКоманда.Модификатор = Модификатор; 
	 
 КонецПроцедуры   