
&НаСервере
Процедура ПостроитьКроссТаблицуНаСервере(ТабДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиКомпанииОбороты.Номенклатура КАК Товар,
		|	ПРЕДСТАВЛЕНИЕ(ПродажиКомпанииОбороты.Номенклатура) КАК ТоварПредставление,
		|	ПродажиКомпанииОбороты.ЗаказПокупателя.Контрагент КАК Покупатель,
		|	ПРЕДСТАВЛЕНИЕ(ПродажиКомпанииОбороты.ЗаказПокупателя.Контрагент) КАК ПокупательПредставление,
		|	ПродажиКомпанииОбороты.СуммаПродажиОборот КАК СуммаПродажиОборот
		|ИЗ
		|	РегистрНакопления.ПродажиКомпании.Обороты КАК ПродажиКомпанииОбороты";
	
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КроссТаблица");
	Если ЛОжь Тогда
		Макет = ПолучитьОбщийМакет();
	КонецЕсли;
	ОбластьШапкаТовар = Макет.ПолучитьОбласть("Шапка|Товар");
	ОбластьШапкаПокупатель = Макет.ПолучитьОбласть("Шапка|Покупатель");
	ОбластьШапкаИтог = Макет.ПолучитьОбласть("Шапка|Итог");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	

	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьКроссТаблицу(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПостроитьКроссТаблицуНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры
