
&НаСервере
Процедура ПостроитьКроссТаблицуНаСервере(ТабДок)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажиКомпанииОбороты.Номенклатура КАК Товар,
	|	ПРЕДСТАВЛЕНИЕ(ПродажиКомпанииОбороты.Номенклатура) КАК ТоварПредставление,
	|	ПродажиКомпанииОбороты.Контрагент КАК Покупатель,
	|	ПРЕДСТАВЛЕНИЕ(ПродажиКомпанииОбороты.Контрагент) КАК ПокупательПредставление,
	|	ПродажиКомпанииОбороты.СуммаОборот КАК Сумма
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты КАК ПродажиКомпанииОбороты
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	Покупатель,
	|	Товар";
	
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("КроссТаблица");
	
	ОбластьШапкаТовар = Макет.ПолучитьОбласть("Шапка|Товар");
	ОбластьШапкаПокупатель = Макет.ПолучитьОбласть("Шапка|Покупатель");
	ОбластьШапкаИтог = Макет.ПолучитьОбласть("Шапка|Итог");
	
	ОбластьСтрокаТовар = Макет.ПолучитьОбласть("Строка|Товар");
	ОбластьСтрокаПокупатель = Макет.ПолучитьОбласть("Строка|Покупатель");
	ОбластьСтрокаИтог = Макет.ПолучитьОбласть("Строка|Итог");
	
	ОбластьПодвалТовар = Макет.ПолучитьОбласть("Подвал|Товар");
	ОбластьПодвалПокупатель = Макет.ПолучитьОбласть("Подвал|Покупатель");
	ОбластьПодвалИтог = Макет.ПолучитьОбласть("Подвал|Итог");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКлиент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Покупатель");
	ТабДок.Вывести(ОбластьШапкаТовар);
	
	Пока ВыборкаКлиент.Следующий() Цикл
		
		ОбластьШапкаПокупатель.Параметры.Заполнить(ВыборкаКлиент);
		ТабДок.Присоединить(ОбластьШапкаПокупатель);
		
		
	КонецЦикла;
	ТабДок.Присоединить(ОбластьШапкаИтог);
	
	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Товар");
	
	Пока ВыборкаТовар.Следующий() Цикл
		
		ОбластьСтрокаТовар.Параметры.Заполнить(ВыборкаТовар);
		ТабДок.Вывести(ОбластьСтрокаТовар);
		
		ВыборкаПокупатель = ВыборкаТовар.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Покупатель", "ВСЕ");
		Пока ВыборкаПокупатель.Следующий() Цикл
			
			ОбластьСтрокаПокупатель.Параметры.Заполнить(ВыборкаПокупатель);
			ТабДок.Присоединить(ОбластьСтрокаПокупатель);
			
		КонецЦикла;
		
		ОбластьСтрокаИтог.Параметры.Заполнить(ВыборкаТовар);
		ТабДок.Присоединить(ОбластьСтрокаИтог);
		
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвалТовар);
	ВыборкаКлиент.Сбросить();
	Пока ВыборкаКлиент.Следующий() Цикл
		
		ОбластьПодвалПокупатель.Параметры.Заполнить(ВыборкаКлиент);
		ТабДок.Присоединить(ОбластьПодвалПокупатель);
		
		
	КонецЦикла;
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Если ВыборкаОбщийИтог.Следующий() Тогда
		
		ОбластьПодвалИтог.Параметры.Заполнить(ВыборкаОбщийИтог);
		ТабДок.Присоединить(ОбластьПодвалИтог);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьКроссТаблицу(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПостроитьКроссТаблицуНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ВыводИтоговСПериодамиНаСервере(ТабДок)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыводИтоговСПериодами(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	ВыводИтоговСПериодамиНаСервере(ТабДок);
	ТабДок.Показать();
	
КонецПроцедуры
