#Область ОбработчикиКомандФормы

// Раздел «Обработчики команд формы» содержит процедуры-обработчики команд формы 
// (имена которых задаются в свойстве Действие команд формы). 


#КонецОбласти
	
#Область ОбработчикиКомандФормы

// Раздел «Обработчики команд формы» содержит процедуры-обработчики команд формы 
// (имена которых задаются в свойстве Действие команд формы). 

&НаКлиенте
Асинх Процедура Демо_ЗадатьВопросАсинх(Команда)
	
    обещание = ВопросАсинх("Купить слона?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	ответ = Ждать обещание; 
	
	Если ответ = КодВозвратаДиалога.Да Тогда
		текст = НСтр("ru='Ответ утвержительный!'");
	ИначеЕсли ответ = КодВозвратаДиалога.Нет Тогда 
		текст = НСтр("ru='Ответ отрицательный!'");
	Иначе
		текст = НСтр("ru='Ответ не получен!'");
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = текст;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Демо_ПоказатьПредупреждениеАсинх(Команда)
	
	текст = НСтр("ru='Это асинхронное предупреждение!'");	
	ПредупреждениеАсинх(текст); 
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Демо_ОткрытьЗначениеАсинх(Команда)
	
    тестовыйСписок = Новый СписокЗначений;
	тестовыйСписок.Добавить("тест1", "тестовое значение 1");
	тестовыйСписок.Добавить("тест2", "тестовое значение 2");
	тестовыйСписок.Добавить("тест3", "тестовое значение 3");
	
	ОткрытьЗначениеАсинх(тестовыйСписок);
	
КонецПроцедуры



#КонецОбласти
	
	



// 	ВопросАсинх
//Предупреждение 	ПоказатьПредупреждение 	ПредупреждениеАсинх
//ОткрытьЗначение 	ПоказатьЗначение 	ОткрытьЗначениеАсинх
//КопироватьФайл 	НачатьКопированиеФайла 	КопироватьФайлАсинх
//ВвестиЧисло 	ПоказатьВводЧисла 	ВвестиЧислоАсинх
//НайтиФайлы 	НачатьПоискФайлов 	НайтиФайлыАсинх
//ПолучитьФайл 	НачатьПолучениеФайлаССервера 	ПолучитьФайлССервераАсинх
