#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьКПапкеСФайлами = "C:\Program Files\1cv8\conf";
	ПутьКФайлу = "C:\Program Files\1cv8\conf\conf.cfg";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Раздел «Обработчики команд формы» содержит процедуры-обработчики команд формы 
// (имена которых задаются в свойстве Действие команд формы). 


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВывестиПараметрыПеременной(ЗНАЧ ПеременнаяДляАнализа)
	
	Сообщение = Новый СообщениеПользователю;
	
	Если ТипЗнч(ПеременнаяДляАнализа) = Тип("Файл") Тогда
		текст = НСтр("ru='Значение переменной: %1, тип: %2, имя файла: %3!'"); 
		текст = СтрШаблон(текст, ПеременнаяДляАнализа, ТипЗнч(ПеременнаяДляАнализа), ПеременнаяДляАнализа.Имя);
	Иначе	
		текст = НСтр("ru='Значение переменной: %1, тип: %2!'"); 
		текст = СтрШаблон(текст, ПеременнаяДляАнализа, ТипЗнч(ПеременнаяДляАнализа));
	КонецЕсли;
	Сообщение.Текст = текст;
	Сообщение.Сообщить(); 
	
	Если ТипЗнч(ПеременнаяДляАнализа) = Тип("ОписаниеПомещенногоФайла") Тогда
		
		Сообщение.Текст = СтрШаблон("Полный путь к файлу: %1", ПеременнаяДляАнализа.СсылкаНаФайл.Файл.ПолноеИмя);
		Сообщение.Сообщить();

		Сообщение.Текст = СтрШаблон("Адрес: %1", ПеременнаяДляАнализа.Адрес);
		Сообщение.Сообщить();
		
		Сообщение.Текст = СтрШаблон("Помещение файла отменено: %1", ПеременнаяДляАнализа.ПомещениеФайлаОтменено);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Если ТипЗнч(ПеременнаяДляАнализа) = Тип("Массив") Тогда
		
		Для каждого ЭлементКоллекции Из ПеременнаяДляАнализа Цикл
			
			ВывестиПараметрыПеременной(ЭлементКоллекции);
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры // ВывестиРезультатСообщением()

&НаКлиенте
Асинх Функция ВызватьОшибку()
	
	ВызватьИсключение "ошибка: слон не обнаружен!";	
	
КонецФункции

&НаКлиенте
Функция ВызватьОшибкуСинх()
	
	ВызватьИсключение "ошибка: слон не обнаружен!";	
	
КонецФункции

#КонецОбласти


#Область ОбработчикиКомандФормы

// Раздел «Обработчики команд формы» содержит процедуры-обработчики команд формы 
// (имена которых задаются в свойстве Действие команд формы). 

&НаКлиенте
Асинх Процедура Демо_ЗадатьВопросАсинх(Команда)
	
	обещание = ВопросАсинх("Купить слона?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Результат = Ждать обещание; 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		текст = НСтр("ru='Ответ утвержительный!'");
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда 
		текст = НСтр("ru='Ответ отрицательный!'");
	Иначе
		текст = НСтр("ru='Ответ не получен!'");
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = текст;
	Сообщение.Сообщить();
	
	ВывестиПараметрыПеременной(Результат);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Демо_ПоказатьПредупреждениеАсинх(Команда)
	
	текст = НСтр("ru='Это асинхронное предупреждение!'");	
	Обещание = ПредупреждениеАсинх(текст); 
	Результат = Ждать Обещание;
	
	ВывестиПараметрыПеременной(Результат);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Демо_ОткрытьЗначениеАсинх(Команда)
	
	тестовыйСписок = Новый СписокЗначений;
	тестовыйСписок.Добавить("тест1", "тестовое значение 1");
	тестовыйСписок.Добавить("тест2", "тестовое значение 2");
	тестовыйСписок.Добавить("тест3", "тестовое значение 3");
	
	Обещание = ОткрытьЗначениеАсинх(тестовыйСписок);
	Результат = Ждать Обещание;
	
	ВывестиПараметрыПеременной(Результат);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Демо_ВвестиЧислоАсинх(Команда)
	
	Обещание = ВвестиЧислоАсинх(1, "укажите любое число");
	Результат = Ждать Обещание;
	
	ВывестиПараметрыПеременной(Результат);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Демо_НайтиФайлыАсинх(Команда)
	
	Обещание = НайтиФайлыАсинх(ПутьКПапкеСФайлами, "*.*", Ложь);
	Результат = Ждать Обещание;
	
	ВывестиПараметрыПеременной(Результат);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Демо_ПоместитьФайлНаСерверАсинх(Команда)
	
	Обещание = ПоместитьФайлНаСерверАсинх(,,, ПутьКФайлу, ЭтаФорма.УникальныйИдентификатор);	
	Результат = Ждать Обещание;
	
	ВывестиПараметрыПеременной(Результат);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Демо_ПоместитьФайлыНаСерверАсинх(Команда)

	Обещание = НайтиФайлыАсинх(ПутьКПапкеСФайлами, "*.*", Ложь);
	Результат = Ждать Обещание;
	
	ДобавляемыеФайлы = Новый Массив;
	Для каждого НайденныйФайл из Результат Цикл
		
		ОписаниеДобавляемогоФайла = Новый ОписаниеПередаваемогоФайла;
		ОписаниеДобавляемогоФайла.Имя = НайденныйФайл.ПолноеИмя;
		ДобавляемыеФайлы.Добавить(ОписаниеДобавляемогоФайла);
		
	КонецЦикла;
	
	Обещание = ПоместитьФайлыНаСерверАсинх(,,ДобавляемыеФайлы, ЭтаФорма.УникальныйИдентификатор);	
	Результат = Ждать Обещание;
	
	ВывестиПараметрыПеременной(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Демо_ПоявлениеИсключенияСинх(Команда)
	
	ВызватьОшибку();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Демо_ПоявлениеИсключенияАсинх(Команда)
	
	Результат = Ждать ВызватьОшибку(); 
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Демо_ПопыткаИсключениеАсинх(Команда)
	
	Попытка
		Результат = Ждать ВызватьОшибку();
	Исключение
		текст = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = текст;
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
