#Область ОписаниеПеременных

// переменные для автотестов
&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Утверждения;

#КонецОбласти

 #Область Автотесты

//{ основная процедура для юнит-тестирования xUnitFor1C

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;

	НаборТестов.НачатьГруппу("Проверка реквизитов");
	НаборТестов.Добавить("ТестДолжен_ПроверитьНаличиеРеквизитаНастройкаОтправкиНаФорме");
		
КонецПроцедуры

//}

//{ Блок юнит-тестов

&НаКлиенте
Процедура ПередЗапускомТеста() Экспорт
	
	//НачатьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапускаТеста() Экспорт
	
	//Если ТранзакцияАктивна() Тогда
	//    ОтменитьТранзакцию();
	//КонецЕсли;
	
КонецПроцедуры

// проверить подключение к рэббит
 
&НаКлиенте
Процедура ТестДолжен_ПроверитьНаличиеРеквизитаНастройкаОтправкиНаФорме() Экспорт
	
	ФормаСпособаДоставки = ПолучитьФорму("Справочник.гиг_СпособыДоставки.ФормаОбъекта");
    ЭлементНаФорме = ФормаСпособаДоставки.Элементы.Найти("НастройкаОтправкиТК");
	Утверждения.ПроверитьНеРавенство(ЭлементНаФорме, Неопределено, "Элемент не выведен на форму");
	
КонецПроцедуры


// вспомогательная процедура, где описаны какие базовые утверждения есть у фреймворка xddRunner
&НаКлиенте
Процедура УтвержденияПодсказка()
	
	// Утверждения.Проверить(Значение, ДопСообщениеОшибки) - проверить на равенство с Истина
	// Утверждения.ПроверитьИстину(Значение, ДопСообщениеОшибки) - проверить на равенство с Истина
	// Утверждения.ПроверитьЛожь(Значение, ДопСообщениеОшибки) - проверить на равенство с Ложь
	// Утверждения.ПроверитьРавенство(Значение1, Значение2, ДопСообщениеОшибки) - проверить равенство
	// Утверждения.ПроверитьНеРавенство(Значение1, Значение2, ДопСообщениеОшибки) - проверить неравенство
	
КонецПроцедуры

#КонецОбласти // TDD

