// служебная обработка, чтобы быстро создать большое кол-во номенклатуры для тестов производительности созданного списка номенклатуры

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СоздатьНоменклатуруНаСервере()
	
	ИмяГруппы = "Аналоги №";
	ИмяТовара = "Товар №";
	ИмяГруппыРезерва = "Группа резерва №";
	
	Для Сч=1 По 10000 Цикл
	
		НовГруппаРезерва = Справочники.ГруппыАналогов.СоздатьЭлемент();
		НовГруппаРезерва.Наименование = ИмяГруппыРезерва + Формат(Сч, "ЧЦ=4; ЧВН=; ЧГ=");
		НовГруппаРезерва.Записать();
		
		НовГруппаТовара = Справочники.Номенклатура.СоздатьГруппу();
		НовГруппаТовара.Наименование = ИмяГруппы + Формат(Сч, "ЧЦ=4; ЧВН=; ЧГ=");
		НовГруппаТовара.Записать();
		
		Для Счвложенный = 1 По 10 Цикл
		
			НовТовар = Справочники.Номенклатура.СоздатьЭлемент();
			НовТовар.Родитель = НовГруппаТовара.Ссылка;
			НовТовар.Наименование = ИмяТовара + Формат(Сч, "ЧЦ=4; ЧВН=; ЧГ=") + "." + Формат(Счвложенный, "ЧЦ=2; ЧВН=; ЧГ=");
			НовТовар.Записать();
			
			Менеджер = РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
			Менеджер.Номенклатура = НовТовар.Ссылка;
			Менеджер.ГруппаАналогов = НовГруппаРезерва.Ссылка;
			Менеджер.Записать()
		
		КонецЦикла;
	
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	СоздатьНоменклатуруНаСервере();
КонецПроцедуры

#КонецОбласти

