// @strict-types

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПутиК1СНабор = ПолучитьПутиК1С();
	Если ПутиК1СНабор.Количество() > 0 Тогда
		ПутьК1С = ПутиК1СНабор[0];
	КонецЕсли;
	
КонецПроцедуры


// ТЕСТЫ

&НаКлиенте
Процедура Тест_ПолучитьПутиК1С()
	
	ПроверитьЛожь(0, ПолучитьПутиК1С().Количество(), "Тест_ПутиЗаполнены");	
	
КонецПроцедуры

&НаКлиенте
Процедура Тест_ФормированиеСтроки()
	
	Эталон = "C:\Program Files\1cv8\8.3.20.1674\bin\1cv8.exe designer";
	
	ПараметрыСтроки = Новый Структура;
	ПараметрыСтроки.Вставить("ПутьК1с", "C:\Program Files\1cv8\8.3.20.1674\bin\1cv8.exe");
	ПараметрыСтроки.Вставить("РежимЗапуска", "designer");
	
	Проверить(Эталон, СформироватьСтроку(ПараметрыСтроки), "Тест_РезультатКорректен");	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьТесты(Команда)
	Тест_ПолучитьПутиК1С();
	Тест_ФормированиеСтроки();
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Эталон, Значение, ПоясняющийТекст = "")
	
	Если Эталон <> Значение Тогда
		Текст = "[X]Тест провален";
	Иначе
		Текст = "[V]Тест пройден";
	КонецЕсли;
	
	Текст = Текст + ?(ПоясняющийТекст = "", "", " (" + ПоясняющийТекст + ")");
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

КонецПроцедуры

// РАБОЧИЙ КОД

// Получить пути к1 С.
// 
// Возвращаемое значение:
//  массив из строка
&НаКлиенте
Функция ПолучитьПутиК1С()
	
	ПутиК1С = Новый Массив;
	ПутиК1С.Добавить("C:\Program Files\1cv8\8.3.20.1674\bin\1cv8.exe");
	Возврат ПутиК1С;
	
КонецФункции

&НаКлиенте
Процедура ВариантЗапускаПриИзменении(Элемент)
	
	ПараметрыСтроки = Новый Структура;
	ПараметрыСтроки.Вставить("ПутьК1с", "C:\Program Files\1cv8\8.3.20.1674\bin\1cv8.exe");
	ПараметрыСтроки.Вставить("РежимЗапуска", ВариантЗапуска);
	Результат = СформироватьСтроку(ПараметрыСтроки);
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьСтроку(ПараметрыСтроки)
	
	ПараметрыЗапуска = Новый Массив;
	ПараметрыЗапуска.добавить(ПараметрыСтроки.ПутьК1с);
	ПараметрыЗапуска.добавить(ПараметрыСтроки.РежимЗапуска);
	
	Возврат СтрСоединить(ПараметрыЗапуска, " ");
	
КонецФункции


&НаКлиенте
Процедура ПроверитьЛожь(Эталон, Значение, ПоясняющийТекст = "")
	
	Если Эталон = Значение Тогда
		Текст = "[X]Тест провален";
	Иначе
		Текст = "[V]Тест пройден";
	КонецЕсли;
	
	Текст = Текст + ?(ПоясняющийТекст = "", "", " (" + ПоясняющийТекст + ")");
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

КонецПроцедуры

