
&НаКлиенте
Процедура КомандаCтрШаблон(Команда)
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ШаблонСтроки = "моя строка: %1, %2, %3, %4";
	Для сч = 1 по КонецСч Цикл
		
		//лРез = СтрШаблон(ШаблонСтроки, сч);
		лРез = СтрШаблон(ШаблонСтроки, сч, сч, сч, сч);
		
	КонецЦикла;
	
	Конец = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ВывестиРезультат("КомандаCтрШаблон", Начало, Конец, КонецСч);
	
КонецПроцедуры 

&НаКлиенте
Процедура ВывестиРезультат(КомадаТеста, Начало, Конец, КонецСч)
	
	Дельта = (Конец - Начало) / 1000;
	
	Сообщение = Новый СообщениеПользователю;

	Сообщение.Текст = СтрШаблон("Команда: %1, длительность: %2 на кол-ве циклов: %3", 
		КомадаТеста, Дельта, КонецСч);
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтрока(Команда)
	
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ШаблонСтроки = "моя строка: ";
	Для сч = 1 по КонецСч Цикл
		
		//лРез = ШаблонСтроки + сч;
		лРез = ШаблонСтроки + сч + ", " + сч + ", " + сч + ", " + сч;
		
	КонецЦикла;
	
	Конец = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ВывестиРезультат("КомандаСложениеСтрок", Начало, Конец, КонецСч);

КонецПроцедуры

&НаКлиенте
Процедура КомандаСтрСоединить(Команда)
	
	
	ШаблонСтроки = "моя строка:";
	
	м = Новый массив;
	Для сч = 1 по КонецСч Цикл
		
		н = Новый Массив;
		н.Добавить(ШаблонСтроки);
		н.Добавить(сч);
		н.Добавить(сч);
		н.Добавить(сч);
		н.Добавить(сч);
		м.Добавить(н);
		
	КонецЦикла;

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();

	для Каждого н из м Цикл
		СтрСоединить(н, " ");
	КонецЦикла;
	
	Конец = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ВывестиРезультат("КомандаСтрСоединить", Начало, Конец, КонецСч);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонецСч = 1000000;
	
КонецПроцедуры
