#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыОбработки = ПараметрыОбработки();
	
	Сведения = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	Сведения.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	Сведения.Наименование = ПараметрыОбработки.Наименование;
	
	стр = Сведения.Команды.Добавить();
	стр.Представление = ПараметрыОбработки.Представление;
	стр.Идентификатор = ПараметрыОбработки.Идентификатор;
	стр.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	
	Возврат Сведения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыОбработки()
	
	Структура = Новый Структура();
	Структура.Вставить("Представление", "Работа с системными настройками");
	Структура.Вставить("Наименование", "Работа с системными настройками");
	Структура.Вставить("Идентификатор", "РаботаССистемнымиНастройками");
	Структура.Вставить("Версия", "1.2");
	Возврат Структура;
	
КонецФункции

#КонецОбласти