#language: ru

@tree

Функционал: Начальное заполнение тестовой базы

Как разработчик я хочу
добавить в тестовую базу тестовые данные
чтобы запустить алгоритмы тестирования

Контекст:
Дано Я открыл новый сеанс TestClient или подключил уже существующий

Сценарий: Начальное заполнение тестовой базы

Дано В командном интерфейсе я выбираю 'CRM и маркетинг' 'Виды номенклатуры'
Тогда открылось окно 'Виды номенклатуры'
И я нажимаю на кнопку с именем 'Создать'
Тогда открылось окно 'Вид номенклатуры (создание)'
И в поле с именем 'Наименование' я ввожу текст '_Тестовая характеристика'
И у поля с именем "ТипНоменклатуры" я нажимаю гиперссылку 'указать'
Тогда открылось окно 'Выберите тип номенклатуры'
И я меняю значение переключателя с именем 'ТипНоменклатурыТовар' на 'Товар'
И я нажимаю на кнопку с именем 'ОК'
Тогда открылось окно 'Вид номенклатуры (создание) *'
И я устанавливаю флаг с именем 'ИспользоватьХарактеристики'
И я нажимаю на кнопку с именем 'ФормаЗаписать'
И я разворачиваю группу с именем "СтраницаДопРеквизиты"
И в таблице "ТаблицаДопРеквизитовХарактеристик" я нажимаю на кнопку с именем 'ХарактеристикиСоздатьНовыйРеквизитХарактеристики'
Тогда открылось окно 'Дополнительный реквизит (создание)'
И в поле с именем 'Заголовок' я ввожу текст '_Тестовая'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Дополнительный реквизит (создание) *' в течение 20 секунд
И у поля с именем "ВладелецХарактеристик" я нажимаю гиперссылку 'Список'
Тогда открылось окно 'Характеристики номенклатуры (_Тестовая характеристика)'
И в таблице "Список" я нажимаю на кнопку с именем 'СписокСоздать'
Тогда открылось окно 'Характеристика номенклатуры (создание)'
И в поле с именем 'Наименование' я ввожу текст '_Тестовая характеристика1'
И я нажимаю кнопку выбора у поля "_Тестовая"
Тогда открылось окно 'Выберите значение свойства _Тестовая'
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно 'Значение свойства _Тестовая (Создание)'
И в поле с именем 'Наименование' я ввожу текст '_Тестовая характеристика1'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Значение свойства _Тестовая (Создание) *' в течение 20 секунд
Тогда открылось окно 'Выберите значение свойства _Тестовая'
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Характеристика номенклатуры (создание) *'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Характеристика номенклатуры (создание) *' в течение 20 секунд
Тогда открылось окно 'Характеристики номенклатуры (_Тестовая характеристика)'
И в таблице "Список" я нажимаю на кнопку с именем 'СписокСкопировать'
Тогда открылось окно 'Характеристика номенклатуры (создание)'
И в поле с именем 'Наименование' я ввожу текст '_Тестовая характеристика2'
И я перехожу к следующему реквизиту
И я нажимаю кнопку выбора у поля "_Тестовая"
Тогда открылось окно 'Выберите значение свойства _Тестовая'
И я нажимаю на кнопку с именем 'ФормаСкопировать'
Тогда открылось окно 'Значение свойства _Тестовая (Создание)'
И в поле с именем 'Наименование' я ввожу текст '_Тестовая характеристика2'
И я перехожу к следующему реквизиту
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Значение свойства _Тестовая (Создание) *' в течение 20 секунд
Тогда открылось окно 'Выберите значение свойства _Тестовая'
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Характеристика номенклатуры (создание) *'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Характеристика номенклатуры (создание) *' в течение 20 секунд
Тогда открылось окно 'Характеристики номенклатуры (_Тестовая характеристика)'
И Я закрываю окно 'Характеристики номенклатуры (_Тестовая характеристика)'
И я закрываю все окна клиентского приложения
И В командном интерфейсе я выбираю 'НСИ и администрирование' 'Номенклатура'
Тогда открылось окно 'Номенклатура'
И я нажимаю на кнопку с именем 'СписокРасширенныйПоискНоменклатураСоздать'
Тогда открылось окно 'Номенклатура (создание)'
И в поле с именем 'ВидНоменклатурыОбязательныеПоля' я ввожу текст '_'
И я нажимаю кнопку выбора у поля с именем "ВидНоменклатурыОбязательныеПоля"
Тогда открылось окно 'Виды номенклатуры'
И в таблице "Список" я перехожу к строке:
	| 'Наименование'             |
	| '_Тестовая характеристика' |
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Номенклатура (создание) *'
И в поле с именем 'Наименование' я ввожу текст '_Тестовая номенклатура 1'
И я нажимаю кнопку выбора у поля с именем "ЕдиницаИзмерения"
Тогда открылось окно 'Выберите единицу измерения'
И в таблице "Список" я перехожу к строке:
	| 'Международное сокращение' | 'Наименование' |
	| 'PCE'                      | 'шт'           |
И в таблице "Список" я выбираю текущую строку
Тогда открылось окно 'Номенклатура (создание) *'
И я нажимаю на кнопку с именем 'ФормаЗаписать'
Тогда открылось окно '_Тестовая номенклатура * (Номенклатура)'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна '_Тестовая номенклатура * (Номенклатура)' в течение 20 секунд
Тогда открылось окно 'Номенклатура'
И я нажимаю на кнопку с именем 'СписокРасширенныйПоискНоменклатураСоздать'
Тогда открылось окно 'Номенклатура (создание)'
И из выпадающего списка с именем "ВидНоменклатурыОбязательныеПоля" я выбираю точное значение '_Тестовая характеристика'
И в поле с именем 'Наименование' я ввожу текст '_Тестовая номенклатура 2'
И из выпадающего списка с именем "ЕдиницаИзмерения" я выбираю по строке 'шт'
И я перехожу к следующему реквизиту
И я перехожу к закладке с именем "СворачиваемаяГруппаРегламентированныйУчет"
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Номенклатура (создание) *' в течение 20 секунд
Тогда открылось окно 'Номенклатура'
И я нажимаю на кнопку с именем 'СписокРасширенныйПоискНоменклатураСоздать'
Тогда открылось окно 'Номенклатура (создание)'
И из выпадающего списка с именем "ВидНоменклатурыОбязательныеПоля" я выбираю по строке ''
И в поле с именем 'Наименование' я ввожу текст '_Тестовая номенклатура 3'
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Номенклатура (создание) *' в течение 20 секунд
И из выпадающего списка с именем "ЕдиницаИзмерения" я выбираю по строке 'шт'
И я перехожу к следующему реквизиту
И я перехожу к закладке с именем "СворачиваемаяГруппаРегламентированныйУчет"
И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
И я жду закрытия окна 'Номенклатура (создание) *' в течение 20 секунд
И я закрываю все окна клиентского приложения
И В командном интерфейсе я выбираю 'НСИ и администрирование' 'Начальное заполнение'
Тогда открылось окно 'Начальное заполнение'
И в таблице "ДеревоОпераций" я перехожу к строке по шаблону:
	| 'Представление операции'              |
	| 'Ввод остатков собственных товаров *' |
И в таблице "Список" я нажимаю на кнопку с именем 'СписокСоздать'
Тогда открылось окно 'Ввод начальных остатков собственных товаров (создание)'
И в поле с именем 'СобственныеТоварыДата' я ввожу текст '01.01.2022  0:00:00'
И я перехожу к следующему реквизиту
И из выпадающего списка с именем "СобственныеТоварыСклад" я выбираю по строке 'РС Россия Новосибирск'
И я перехожу к следующему реквизиту
И из выпадающего списка с именем "СобственныеТоварыМенеджер" я выбираю по строке 'гиг'
И я перехожу к следующему реквизиту
И из выпадающего списка с именем "СобственныеТоварыПодразделение" я выбираю точное значение 'РС Новосибирск'
И я нажимаю на кнопку создать поля с именем "СобственныеТоварыПартия"
Тогда открылось окно ' (создание)'
И из выпадающего списка с именем "ТипПервичногоДокумента" я выбираю точное значение 'Внутренняя накладная'
Тогда открылось окно 'Внутренняя накладная (создание) *'
И из выпадающего списка с именем "НалогообложениеНДС" я выбираю точное значение 'Не облагается НДС'
И в поле с именем 'Номер' я ввожу текст '1'
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я жду закрытия окна 'Внутренняя накладная (создание) *' в течение 20 секунд
Тогда открылось окно 'Ввод начальных остатков собственных товаров (создание) *'
И в таблице "СобственныеТовары" я нажимаю на кнопку с именем 'СобственныеТоварыДобавить'
И в таблице "СобственныеТовары" из выпадающего списка с именем "СобственныеТоварыНоменклатура" я выбираю по строке '_Тестовая номенклатура 1'
И в таблице "СобственныеТовары" я завершаю редактирование строки
И в таблице "СобственныеТовары" я активизирую поле с именем "СобственныеТоварыХарактеристика"
И в таблице "СобственныеТовары" из выпадающего списка с именем "СобственныеТоварыХарактеристика" я выбираю по строке '_Тестовая характеристика1'
И в таблице "СобственныеТовары" я завершаю редактирование строки
И в таблице "СобственныеТовары" в поле с именем 'СобственныеТоварыКоличествоУпаковок' я ввожу текст '1 000,000'
И в таблице "СобственныеТовары" я завершаю редактирование строки
И в таблице "СобственныеТовары" в поле с именем 'СобственныеТоварыЦена' я ввожу текст '1 000,00'
И в таблице "СобственныеТовары" я завершаю редактирование строки
И в таблице "СобственныеТовары" я нажимаю на кнопку с именем 'СобственныеТоварыДобавить'
И в таблице "СобственныеТовары" из выпадающего списка с именем "СобственныеТоварыНоменклатура" я выбираю по строке '_Тестовая номенклатура 1'
И в таблице "СобственныеТовары" я завершаю редактирование строки
И в таблице "СобственныеТовары" я активизирую поле с именем "СобственныеТоварыХарактеристика"
И в таблице "СобственныеТовары" из выпадающего списка с именем "СобственныеТоварыХарактеристика" я выбираю по строке '_Тестовая характеристика2'
И в таблице "СобственныеТовары" я завершаю редактирование строки
И в таблице "СобственныеТовары" я активизирую поле с именем "СобственныеТоварыКоличествоУпаковок"
И в таблице "СобственныеТовары" я выбираю текущую строку
И в таблице "СобственныеТовары" в поле с именем 'СобственныеТоварыКоличествоУпаковок' я ввожу текст '1 000,000'
И в таблице "СобственныеТовары" я завершаю редактирование строки
И в таблице "СобственныеТовары" я активизирую поле с именем "СобственныеТоварыЦена"
И в таблице "СобственныеТовары" я выбираю текущую строку
И в таблице "СобственныеТовары" в поле с именем 'СобственныеТоварыЦена' я ввожу текст '2 000,00'
И в таблице "СобственныеТовары" я завершаю редактирование строки
И в таблице "СобственныеТовары" я перехожу к строке:
	| 'N' | 'Код'         | 'Количество' | 'Номенклатура'             | 'Серия'                  | 'Сумма (регл.)' | 'Сумма (РУБ.)' | 'Упаковка' | 'Характеристика'            | 'Цена (РУБ.)' |
	| '1' | 'ЕР-00005234' | '1 000,000'  | '_Тестовая номенклатура 1' | '<серия не указывается>' | '833 333,33'    | '1 000 000,00' | 'шт'       | '_Тестовая характеристика1' | '1 000,00'    |
И я выбираю пункт контекстного меню с именем 'СобственныеТоварыКонтекстноеМенюСкопировать' на элементе формы с именем "СобственныеТовары"
И в таблице "СобственныеТовары" из выпадающего списка с именем "СобственныеТоварыНоменклатура" я выбираю по строке '_Тестовая номенклатура 2'
И я перехожу к следующему реквизиту
И в таблице "СобственныеТовары" я завершаю редактирование строки
И в таблице "СобственныеТовары" я перехожу к строке:
	| 'N' | 'Номенклатура'             |
	| '2' | '_Тестовая номенклатура 1' |
И в таблице "СобственныеТовары" я активизирую поле с именем "СобственныеТоварыНоменклатура"
И я выбираю пункт контекстного меню с именем 'СобственныеТоварыКонтекстноеМенюСкопировать' на элементе формы с именем "СобственныеТовары"
И в таблице "СобственныеТовары" из выпадающего списка с именем "СобственныеТоварыНоменклатура" я выбираю по строке '_Тестовая номенклатура 2'
И я перехожу к следующему реквизиту
И в таблице "СобственныеТовары" я перехожу к строке:
	| 'N' | 'Номенклатура'             | 'Характеристика'            |
	| '1' | '_Тестовая номенклатура 1' | '_Тестовая характеристика1' |
И я выбираю пункт контекстного меню с именем 'СобственныеТоварыКонтекстноеМенюСкопировать' на элементе формы с именем "СобственныеТовары"
И в таблице "СобственныеТовары" из выпадающего списка с именем "СобственныеТоварыНоменклатура" я выбираю по строке '_Тестовая номенклатура 3'
И я перехожу к следующему реквизиту
И в таблице "СобственныеТовары" я завершаю редактирование строки
И в таблице "СобственныеТовары" я перехожу к строке:
	| 'N' | 'Номенклатура'             |
	| '2' | '_Тестовая номенклатура 1' |
И в таблице "СобственныеТовары" я активизирую поле с именем "СобственныеТоварыНоменклатура"
И я выбираю пункт контекстного меню с именем 'СобственныеТоварыКонтекстноеМенюСкопировать' на элементе формы с именем "СобственныеТовары"
И в таблице "СобственныеТовары" из выпадающего списка с именем "СобственныеТоварыНоменклатура" я выбираю по строке '_Тестовая номенклатура 3'
И в таблице "СобственныеТовары" я завершаю редактирование строки
И я нажимаю на кнопку с именем 'ФормаПровестиИЗакрыть'
И я закрываю все окна клиентского приложения



