
Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(ГруппаАналогов) Тогда
		
		Менеджер = РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
		Менеджер.Номенклатура = Ссылка;
		Менеджер.ГруппаАналогов = ГруппаАналогов;
		Менеджер.Записать();
		
	Иначе
		
		Менеджер = РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
		Менеджер.Номенклатура = Ссылка;
		Менеджер.Прочитать();
		
		Если Менеджер.Выбран() Тогда
			Менеджер.Удалить();
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры
